---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AnalysisDisplayVectorSettings Constructor
AnalysisDisplayVectorSettings Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | AnalysisDisplayVectorSettings()()()() | Constructs a default instance of vector settings. |
|  | AnalysisDisplayVectorSettings(AnalysisDisplayVectorSettings) | Constructs a new copy of the input AnalysisDisplayVectorSettings object. |

# See Also

AnalysisDisplayVectorSettings Class

AnalysisDisplayVectorSettings Members

Autodesk.Revit.DB.Analysis Namespace